myyelp/app/views/businesses/index.html.haml

SELECT "businesses".* FROM "businesses"  WHERE "businesses"."category_id" = $1  ORDER BY created_at DESC  [["category_id", 1]]
---
      .businesses.row
        - category.businesses.each do |business|
          .business.col-sm-4