myyelp/app/controllers/businesses_controller.rb

INSERT INTO "businesses" ("category_id", "created_at", "description", "name", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["category_id", 1], ["created_at", "2016-01-04 10:15:51.799476"], ["description", "rustic pizza"], ["name", "Motorino"], ["updated_at", "2016-01-04 10:15:51.799476"]]
---
  def create
    @business = Business.new(business_params)

    if @business.save

SELECT  "businesses".* FROM "businesses"  WHERE "businesses"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @business = Business.find(params[:id])