myyelp/app/controllers/reviews_controller.rb

  def index
    @reviews = Review.order('created_at DESC')
---
SELECT "reviews".* FROM "reviews"   ORDER BY created_at DESC

  def create
    @business = Business.find(params[:business_id])
    @review = @business.reviews.build(review_params)
    @review.creator = current_user

    if @review.save
---
SELECT  "businesses".* FROM "businesses"  WHERE "businesses"."id" = $1 LIMIT 1  [["id", 9]]
INSERT INTO "reviews" ("business_id", "created_at", "rating", "review", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["business_id", 9], ["created_at", "2016-01-12 03:47:11.927788"], ["rating", 4], ["review", "awesome"], ["updated_at", "2016-01-12 03:47:11.927788"], ["user_id", 1]]