myyelp/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "full_name", "password_digest", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if @user.save

SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."user_id" = $1  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @reviews = @user.reviews.all